Repository: zopefoundation/z3c.form
Catalog: src/z3c/form/locales/*/LC_MESSAGES/z3c.form.po
Languages: ro

source: Add
ro: Adaugă

source: Remove selected
ro: Eliminați valoarea selectată

source: No value
ro: Nicio valoare

source: Select a value ...
ro: Selectați o valoare...

source: The entered value is not a valid integer literal.
ro: Valoarea introdusă nu este un număr întreg valid.

source: The entered value is not a valid decimal literal.
ro: Valoarea introdusă nu este un număr zecimal valid.

source: Bytes data are not a file object
ro: Datele în format bytes nu reprezintă un fișier.

source: The system could not process the given value.
ro: Sistemul nu a putut procesa valoarea dată.

source: <span class="required">*</span>&ndash; required
ro: <span class="required">*</span>&ndash; necesar

source: There were some errors.
ro: Au fost unele erori.

source: Data successfully updated.
ro: Datele au fost actualizate cu succes.

source: No changes were applied.
ro: Nu au fost aplicate modificări.

source: Apply
ro: Aplică

source: The context in which the data are validated.
ro: Contextul în care datele sunt validate.

source: The widget that the view is on
ro: Widgetul pe care este activată vizualizarea

source: Error
ro: Eroare

source: Error the view is for.
ro: Eroare pentru vizualizarea.

source: Title
ro: Titlu

source: The name of the field within the form.
ro: Numele câmpului din formular.

source: Schema Field
ro: Câmp definit în schemă

source: The schema field that is to be rendered.
ro: Câmpul definit în schemă care urmează să fie redat.

source: The prefix of the field used to avoid name clashes.
ro: Prefixul câmpului folosit pentru a evita conflictele de nume.

source: Mode
ro: Mod

source: The mode in which to render the widget for the field.
ro: Modul în care se redă widgetul pentru câmp.

source: Interface
ro: Interfață

source: The interface from which the field is coming.
ro: Interfața din care provine câmpul.

source: Ignore Context
ro: Ignorați contextul

source: A flag, when set, forces the widget not to look at the context for a value.
ro: Când este setat, forțează widgetul să nu se uite la context pentru o valoare.

source: Widget Factory
ro: Fabrica widgetului

source: The widget factory.
ro: Fabrica widgetului.

source: Show default value
ro: Afișați valoarea implicită

source: A flag, when set, makes the widget to displayfield|adapter provided default values.
ro: Atunci când este setat, face ca widgetul să afișeze valorile implicite ale câmpului|adaptorului

source: True-value Label
ro: Etichetă cu valoare adevărată

source: The label for a true value of the Bool field.
ro: Eticheta pentru o valoare adevărată a câmpului Bool.

source: False-value Label
ro: Etichetă cu valoare falsă

source: The label for a false value of the Bool field.
ro: Eticheta pentru o valoare falsă a câmpului Bool.

source: Name
ro: Nume

source: The name the widget is known under.
ro: Numele sub care este cunoscut widgetul.

source: Label
ro: Eticheta

source: The widget label. Label may be translated for the request. The attribute may be implemented as either a read-write or read-only property, depending on the requirements for a specific implementation.
ro: Eticheta widgetului. Eticheta poate fi tradusă pentru cerere. Atributul poate fi implementat fie ca citire-scriere, fie ca doar citire proprietate, în funcție de cerințele pentru o anumită implementare.

source: A widget mode.
ro: Mod redare widget.

source: Required
ro: Necesar

source: If true the widget should be displayed as required input.
ro: Dacă este adevărat, widget-ul ar trebui să fie afișat ca intrare necesară.

source: If an error occurred during any step, the error view stored here.
ro: Dacă a apărut o eroare în timpul oricărui pas, vizualizarea erorilor este stocată aici.

source: Value
ro: Valoare

source: The value that the widget represents.
ro: Valoarea pe care o reprezintă widget-ul.

source: Ignore Request
ro: Ignorați cererea

source: A flag, when set, forces the widget not to look at the request for a value.
ro: Atunci când este setat, forțează widget-ul să nu se uite la cererea pentru o valoare.

source: Set errors
ro: Setați erori

source: A flag, when set, the widget sets error messages on calling extract().
ro: Atunci când este setat, widget-ul setează mesaje de eroare la apelarea extract().

source: Ignore Required validation
ro: Ignorați Validarea necesară

source: If set then required fields will pass validation regardless whether they're filled in or not
ro: Dacă se setează, câmpurile obligatorii vor trece validarea, indiferent dacă sunt completate sau nu

source: The token to be used, if no value has been selected.
ro: Token-ul care trebuie utilizat, dacă nu a fost selectată nicio valoare.

source: Terms
ro: Termeni

source: A component that provides the options for selection.
ro: O componentă care oferă opțiuni de selecție.

source: A flag, when set, enables a choice explicitely requesting the user to choose a value.
ro: Atunci când este setat, permite o alegere solicitând în mod explicit utilizatorului să aleagă o valoare.

source: Items
ro: Articole

source: A collection of dictionaries containing all pieces of information for rendering. The following keys must be in each dictionary: id, value, content, selected
ro: O colecție de dicționare care conțin toate informațiile pentru redare. Următoarele chei trebuie să fie în fiecare dicționar: id, value, content, selected

source: No-Value Message
ro: Mesaj lipsă valoare

source: A human-readable text that is displayed to refer the missing value.
ro: Un text care poate fi citit de om, care este afișat pentru a se referi la valoarea lipsă.

source: Prompt Message
ro: Mesaj prompt

source: The prefix of the widgets.
ro: Prefixul widget-urilor.

source: Errors
ro: Erori

source: The collection of errors that occured during validation.
ro: Colecția de erori care au apărut în timpul validării.

source: If set the context is ignored to retrieve a value.
ro: Dacă este setat, contextul este ignorat pentru a prelua o valoare.

source: If set the request is ignored to retrieve a value.
ro: Dacă este setată, cererea este ignorată pentru a prelua o valoare.

source: Ignore Readonly
ro: Ignorați numai în citire

source: If set then readonly fields will also be shown.
ro: Dacă este setat, vor fi afișate și câmpuri numai în citire.

source: Ignore Required validation on extract
ro: Ignorați Validarea necesară pentru extragere

source: If set then required fields will pass validation on extract regardless whether they're filled in or not
ro: Dacă se setează, câmpurile obligatorii vor trece validarea extrasului, indiferent dacă sunt completate sau nu

source: Has required fields
ro: Are câmpuri obligatorii

source: A flag set when at least one field is marked as required
ro: Setat atunci când cel puțin un câmp este marcat ca fiind obligatoriu

source: A flag, when set, the contained widgets set error messages on calling extract().
ro: Un indicator, atunci când este setat, widget-urile conținute setează mesaje de eroare la apelarea extract().

source: Field
ro: Câmp

source: The schema field which the widget is representing.
ro: Câmpul de schemă pe care îl reprezintă widget-ul.

source: The object name.
ro: Numele obiectului.

source: The action title.
ro: Titlul acțiunii.

source: Action
ro: Acţiune

source: The action for which the event is created.
ro: Acțiunea pentru care este creat evenimentul.

source: The error that occurred during the action.
ro: Eroarea care a apărut în timpul acțiunii.

source: Access Key
ro: Cheie de acces

source: The key when pressed causes the button to be pressed.
ro: Tasta atunci când este apăsată face ca butonul să fie apăsat.

source: Action Factory
ro: Fabrica acțiunii

source: The action factory.
ro: Fabrica acțiunii.

source: Image Path
ro: Calea imaginii

source: A relative image path to the root of the resources.
ro: O cale relativă a imaginii către rădăcina resurselor.

source: Handlers
ro: Manipulatorii

source: A list of action handlers defined on the form.
ro: O listă de gestionari de acțiuni definiți în formular.

source: Actions
ro: Acțiuni

source: A list of actions defined on the form
ro: O listă de acțiuni definite în formular

source: Refresh actions
ro: Acțiuni de reîmprospătare

source: A flag, when set, causes form actions to be updated again after their execution.
ro: Un indicator, atunci când este setat, face ca acțiunile din formular să fie actualizate din nou după executarea lor.

source: The context in which the widget is displayed.
ro: Contextul în care este afișat widgetul.

source: The mode in which to render the widgets.
ro: Modul în care să redați widget-urile.

source: Widgets
ro: Widgeturi

source: A widget manager containing the widgets to be used in the form.
ro: Un manager de widget-uri care conține widget-urile care vor fi utilizate în formular.

source: A human readable text describing the form that can be used in the UI.
ro: Un text care poate fi citit de om care descrie forma care poate fi utilizată în UI.

source: Label required
ro: Eticheta necesară

source: A human readable text describing the form that can be used in the UI for rendering a required info legend.
ro: Un text care poate fi citit de om care descrie formularul care poate fi utilizat în interfața de utilizare pentru a reda o legendă a informațiilor necesare.

source: The prefix of the form used to uniquely identify it.
ro: Prefixul formei folosit pentru a o identifica în mod unic.

source: Status
ro: Stare

source: The status message of the form.
ro: Mesajul de stare al formularului.

source: The action defines the URI to which the form data are sent.
ro: Acțiunea definește URI-ul către care sunt trimise datele din formular.

source: The name of the form used to identify it.
ro: Numele formularului folosit pentru a-l identifica.

source: The id of the form used to identify it.
ro: Id-ul formularului folosit pentru a-l identifica.

source: Method
ro: Metodă

source: The HTTP method used to submit the form.
ro: Metoda HTTP utilizată pentru trimiterea formularului.

source: Encoding Type
ro: Tip de codificare

source: The data encoding used to submit the data safely.
ro: Codificarea datelor folosită pentru a trimite datele în siguranță.

source: Accepted Character Sets
ro: Seturi de caractere acceptate

source: This is a list of character sets the server accepts. By default this is unknown.
ro: Aceasta este o listă de seturi de caractere pe care serverul le acceptă. În mod implicit, acest lucru este necunoscut.

source: Accepted Content Types
ro: Tipuri de conținut acceptate

source: This is a list of content types the server can safely handle.
ro: Aceasta este o listă de tipuri de conținut pe care serverul le poate gestiona în siguranță.

source: Fields
ro: Câmpuri

source: A field manager describing the fields to be used for the form.
ro: Un manager de câmp care descrie câmpurile care vor fi utilizate pentru formular.

source: Content providers
ro: Furnizorii de conținut

source: A manager describing the content providers to be used for the form.
ro: Un manager care descrie furnizorii de conținut care vor fi utilizați pentru formular.

source: Buttons
ro: Butoane

source: A button manager describing the buttons to be used for the form.
ro: Un manager de butoane care descrie butoanele care vor fi utilizate pentru formular.

source: The widget for which the event was created.
ro: Widgetul pentru care a fost creat evenimentul.

source: Missing: ${value}
ro: Lipsește: ${value}

source: yes
ro: da

source: no
ro: nu

source: Missing filename extension.
ro: Lipsește extensia fișierului.

source: Layout template.
ro: Șablon pentru aranjare.

source: Refers to a file containing a page template (should end in extension ``.pt`` or ``.html``).
ro: Se referă la un fișier care conține un șablon de pagină (ar trebui să se termine cu extensia ``.pt`` sau ``.html``).

source: The mode of the template.
ro: Modul șablonului.

source: The mode is used to define input and display templates
ro: Modul este utilizat pentru a defini șabloane de intrare și afișare

source: View
ro: Vizualizare

source: The view for which the template should be available
ro: Vizualizarea pentru care șablonul ar trebui să fie disponibil

source: Layer
ro: Strat

source: The layer for which the template should be available
ro: Stratul pentru care șablonul ar trebui să fie disponibil

source: The field for which the template should be available
ro: Câmpul pentru care șablonul ar trebui să fie disponibil

source: The widget for which the template should be available
ro: Widgetul pentru care șablonul ar trebui să fie disponibil

source: Content Type
ro: Tipul conținutului

source: The content type identifies the type of data.
ro: Tipul de conținut identifică tipul de date.

source: Schema
ro: Schemă

source: The schema of the field for which the template should be available
ro: Schema câmpului pentru care șablonul ar trebui să fie disponibil
